
## SQLite in python (1 & 2)




2023년 1학기 통계학과 김광수

In [ ]:
import sqlite3
con = sqlite3.connect(':memory:')
con = sqlite3.connect('./test.db')

sql_query = """SELECT name FROM sqlite_master
    WHERE type='table';"""

cur = con.cursor()
cur.execute(sql_query)
print(cur.fetchall())
con.execute("PRAGMA foreign_keys = 1")

[('GEEK',)]

## **데이터 베이스 생성**

1. con으로 데이터베이스 및 연결이름 생성
2. sql_quey는 스키마를 확인하기 위한 구문
3. cursor를 통해서 각종 구문을 실행하게 함
4. fetchall()은 모든 결과를 보여주는 출력 구문

In [ ]:
table = """ CREATE TABLE GEEK (
            Email VARCHAR(255) NOT NULL,
            First_Name CHAR(25) NOT NULL,
            Last_Name CHAR(25),
            Score INT
        ); """
cur.execute(table)
print("Table is Ready")

cur.execute("SELECT * FROM GEEK")
print(cur.fetchall())

OperationalError: table GEEK already exists

###**테이블 조작: 생성** **굵은 텍스트**
1. 스키마가 지정된 테이블을 생성
2. execute 구문을 이용
3. 내용을 출력

In [ ]:
cur.execute("INSERT INTO GEEK VALUES (?,?,?,?);", ( 'Ihj@jbnu.ac.kr', 'GY', 'KIM', 30) )
cur.execute("SELECT * FROM GEEK")
print (cur.fetchall())

cur.execute('DELETE FROM GEEK WHERE Score > 20' )
cur.execute("SELECT * FROM GEEK")
print (cur.fetchall())

[('Ihj@jbnu.ac.kr', 'GY', 'KIM', 30)]
[]

###**테이블 조작: 입력과 삭제**
1. 각각의 변수명에 대응해서 값을 입력 (INSERT INTO table VALUES ...)
2. 확인하고 Score가 20이 넘으면 삭제 (DELETE FROM table WHERE ...)
3. 확인 **굵은 텍스트**

In [ ]:
import pandas as pd
df = pd.read_csv('./ZP.csv')
print(df)

df.to_sql('test', con)
cur.execute("SELECT * FROM test")
print(cur.fetchall())

          e-mail    first  last  score
0    g@naver.com   Minhee  Kang     50
1    jk@daum.net  Shinwoo   Kim     70
2  hg@jbnu.ac.kr    Heedo  Kwon     90
3   gg@naver.com    Junsu   Lee     59
4  jop@gmail.com   Jungsu   Lee     89
[(0, 'g@naver.com', 'Minhee', 'Kang', 50), (1, 'jk@daum.net', 'Shinwoo', 'Kim', 70), (2, 'hg@jbnu.ac.kr', 'Heedo', 'Kwon', 90), (3, 'gg@naver.com', 'Junsu', 'Lee', 59), (4, 'jop@gmail.com', 'Jungsu', 'Lee', 89)]

###**테이블 조작: 외부데이터로 생성**
1. pandas를 이용해서 .csv 파일 로딩
2. 구문 <dataframe name>.to_sql 로 입력 (테이터베이스 및 테이블 이름 지정)

In [ ]:
cur.execute("NSERT INTO TEST VALUES (?,?,?,?,?);", (6,'aq@daum.net','Hong','Lee', 40))
ag = 'INSERT INTO TEST VALUES (?,?,?,?,?);'
vals = [(11,'d@naver.com','Heesu','Kim', 50), (12,'aq@daum.net','Hong','Lee', 40)]
cur = con.cursor()
cur.executemany(ag, vals)
cur.execute("SELECT * FROM TEST") cur.execute("SELECT * FROM TEST")
print(cur.fetchall())

[(0, 'g@naver.com', 'Minhee', 'Kang', 50), (1, 'jk@daum.net', 'Shinwoo', 'Kim', 70), (2, 'hg@jbnu.ac.kr', 'Heedo', 'Kwon', 90), (3, 'gg@naver.com', 'Junsu', 'Lee', 59), (4, 'jop@gmail.com', 'Jungsu', 'Lee', 89), (6, 'aq@daum.net', 'Hong', 'Lee', 40)]
[(0, 'g@naver.com', 'Minhee', 'Kang', 50), (1, 'jk@daum.net', 'Shinwoo', 'Kim', 70), (2, 'hg@jbnu.ac.kr', 'Heedo', 'Kwon', 90), (3, 'gg@naver.com', 'Junsu', 'Lee', 59), (4, 'jop@gmail.com', 'Jungsu', 'Lee', 89), (6, 'aq@daum.net', 'Hong', 'Lee', 40), (11, 'd@naver.com', 'Heesu', 'Kim', 50), (12, 'aq@daum.net', 'Hong', 'Lee', 40)]

###**테이블 조작: 추가 삽입**
1. insert 구문을 이용해서 하나의 튜플을 삽입
2. insert 구문을 이용해서 두개의 튜플을 삽입

In [ ]:
cur.execute("DELETE FROM test WHERE score > 40")
cur.execute("SELECT * FROM test")
print(cur.fetchall())
cur.execute("UPDATE TEST SET SCORE = 60 WHERE SCORE = 40")
cur.execute("SELECT * FROM test")
print(cur.fetchall())

[]
[]

###**테이블 조작: 삭제 및 갱신**
1. Score가 40을 초과하면 삭제
2. Score가 40이면 60으로 수정 (UPDATE table SET ... WHERE ...)

In [ ]:
# cur.execute('DROP table target_db')
cur.execute(sql_query)
print(cur.fetchall())

[('GEEK',), ('test',)]

#####현재 테이블들을 확인

In [ ]:
table_db = """ CREATE TABLE target_db (
            Email VARCHAR(255) PRIMARY KEY,
            First_Name CHAR(25) NOT NULL,
            Last_Name CHAR(25),
            Score INT CHECK(Score>10)
        ); """

cur.execute(table_db)
cur = con.cursor()
print(df.itertuples())
for row in df.itertuples():
    sql = "INSERT INTO target_db(Email, First_Name, Last_Name, Score) VALUES (?, ?, ?, ?)"
    cur.execute(sql, (row[1], row[2], row[3], row[4]))
con.commit()
#cur.execute('DELETE FROM target_db')
cur.execute('SELECT * FROM target_db')
print(cur.fetchall())

<map object at 0x787da8bf7280>
[('g@naver.com', 'Minhee', 'Kang', 50), ('jk@daum.net', 'Shinwoo', 'Kim', 70), ('hg@jbnu.ac.kr', 'Heedo', 'Kwon', 90), ('gg@naver.com', 'Junsu', 'Lee', 59), ('jop@gmail.com', 'Jungsu', 'Lee', 89)]

###**테이블 조작: 스키마 지정 테이블 생성 및 입력**

1. 스키마 지정 테이블 생성
2. 루프문을 이용해서 외부데이터 입력
3. 내용 확인

In [ ]:
cur.execute("INSERT INTO target_db(Email, First_Name, Last_Name, Score) values ('G@NAVER.COM','kYUNGSU','LEE', 49)")
cur.execute('SELECT * FROM  target_db')
print(cur.fetchall())
cur.execute("INSERT INTO target_db(Email, First_Name, Last_Name, Score) values ('g@naver.com','kYUNGSU','LEE', 49)")

IntegrityError: UNIQUE constraint failed: target_db.Email

###**기본키: 제약 조건**
1. 하나의 행을 생성된 테이블에 집어 넣음
2. 두번째 집어 넣은 행은 기본키 제약 조건에 어긋나 입력이 안됨

In [ ]:
cur.execute('DROP table target_db')
table_db = """ CREATE TABLE target_db (
            ID INTEGER ,
            First_Name CHAR(25) NOT NULL,
            Last_Name CHAR(25),
            Score INT CHECK(Score>10) PRIMARY KEY NOT NULL UNIQUE
        ); """
cur.execute(table_db)

#####조작용 코드######

In [ ]:
cur.execute(sql_query)
print(cur.fetchall())

rr = cur.execute("PRAGMA table_info('target_db')")
for r2 in rr:
  print (r2)

[('GEEK',), ('test',), ('target_db',)]
(0, 'ID', 'INTEGER', 0, None, 0)
(1, 'First_Name', 'CHAR(25)', 1, None, 0)
(2, 'Last_Name', 'CHAR(25)', 0, None, 0)
(3, 'Score', 'INT', 1, None, 1)

##**기본키**
1. 테이블 이름을 출력
2. 티에블 정보를 rr에 저장해서 출력 (변수정보 마지막 원소가 1인 경우 기본키)

In [ ]:
rows = cur.execute("SELECT name FROM sqlite_master WHERE type = 'table'")
tables = [row[0] for row in rows]
print(tables)

def sql_identifier(s):
    return '"' + s.replace('"', '""') + '"'

for table in tables:
    print("table: " + table)
    rows = cur.execute("PRAGMA table_info({})".format(sql_identifier(table)))
    print(rows.fetchall())
    rows = cur.execute("PRAGMA foreign_key_list({})".format(sql_identifier(table)))
    print(rows.fetchall())

['GEEK', 'test', 'target_db']
table: GEEK
[(0, 'Email', 'VARCHAR(255)', 1, None, 0), (1, 'First_Name', 'CHAR(25)', 1, None, 0), (2, 'Last_Name', 'CHAR(25)', 0, None, 0), (3, 'Score', 'INT', 0, None, 0)]
[]
table: test
[(0, 'index', 'INTEGER', 0, None, 0), (1, 'e-mail', 'TEXT', 0, None, 0), (2, 'first', 'TEXT', 0, None, 0), (3, 'last', 'TEXT', 0, None, 0), (4, 'score', 'INTEGER', 0, None, 0)]
[]
table: target_db
[(0, 'ID', 'INTEGER', 0, None, 0), (1, 'First_Name', 'CHAR(25)', 1, None, 0), (2, 'Last_Name', 'CHAR(25)', 0, None, 0), (3, 'Score', 'INT', 1, None, 1)]
[]

###**기본키: 스키마 확인**
1. 모든 테이블 이름 확인
2. 모든 테이블의 스키마를 한번에 출력

In [ ]:
con.close()

#####데이터베이스와 연결을 끊음#####

In [ ]:
import sqlite3
conn = sqlite3.connect(':memory:')
conn = sqlite3.connect('./test1.db')
conn.execute("PRAGMA foreign_keys = 1")

cur = conn.cursor()

cur.execute('DROP table target_db')
cur = conn.cursor()
table_db = """ CREATE TABLE target_db (
            EMail CHAR(255),
            First_Name CHAR(25) NOT NULL,
            Last_Name CHAR(25) PRIMARY KEY,
            Score INT CHECK(Score>10) NOT NULL UNIQUE
        ); """
cur.execute(table_db)
cur.execute('DROP TABLE target')
tg = """   CREATE TABLE target (
            Email CHAR(255),
            First_Name CHAR(25) NOT NULL,
            Last_Name CHAR(25),
            Score INT CHECK(Score>10),
            FOREIGN KEY (Last_Name) REFERENCES target_db(Last_Name)
            ON DELETE SET NULL ON UPDATE SET NULL
        ); """
cur.execute(tg)

cur.execute(sql_query)
print(cur.fetchall())

[('target_db',), ('target',)]

###**기본키와 외래키: 데이터베이스 및 테이블 생성**
1. 새로운 데이터베이스 생성
2. 두 개의 테이블을 구성, 하나는 기본키가 성으로 되어 있고 또 하나는 다른 테이블의 기본외를 외래키로 가져옴
3. 제약조건의 규칙은 만약 기본키가 삭제되면 NULL로 바꾸는 규칙임
4. 외래키과 제약조건의 활성화는 접속설정 이후 막바로 해야 함

In [ ]:
ag = 'INSERT INTO target_db VALUES (?,?,?,?);'
vals = [('d@naver.com','Heesu','KIM', 50), ('Ihj@jbnu.ac.kr','Hong','LEE', 40)]

cur.executemany(ag, vals)
cur.execute('SELECT * FROM target_db')
print(cur.fetchall())

ag = 'INSERT INTO target VALUES (?,?,?,?);'
vals = [('gg@naver.com','Heesu','KIM', 40), ('weg@jbnu.ac.kr','Dong','LEE', 20)]

cur.executemany(ag, vals)

cur.execute('SELECT * FROM target')
print(cur.fetchall())

[('d@naver.com', 'Heesu', 'KIM', 50), ('Ihj@jbnu.ac.kr', 'Hong', 'LEE', 40)]
[('gg@naver.com', 'Heesu', 'KIM', 40), ('weg@jbnu.ac.kr', 'Dong', 'LEE', 20)]

In [ ]:
# cur.execute('DELETE FROM target_db WHERE Score > -1')
# cur.execute('DELETE FROM target WHERE Score > -1')

###**기본키와 외래키: 제약 조건**
1. 두 개의 테이블에 값을 입력하고 확인
2. 만약에 제약조건을 어긴다면 문제가 발생

In [ ]:
cur.execute("DELETE FROM target_db WHERE Last_Name='KIM'")
cur.execute('SELECT * FROM target_db')
print(cur.fetchall())

cur.execute("PRAGMA foreign_keys = ON")
cur.execute('SELECT * FROM target')
print(cur.fetchall())

[('Ihj@jbnu.ac.kr', 'Hong', 'LEE', 40)]
[('gg@naver.com', 'Heesu', None, 40), ('weg@jbnu.ac.kr', 'Dong', 'LEE', 20)]


###**기본키와 외래키: 참조무결성**
1. 기본키가 있는 테이블에서 KIM이 삭제
2. 외래키를 사용한 테이블에서 NULL로 대체됨

In [ ]:
tg = """ CREATE TABLE tmpp (
         Email CHAR(255),
         First_Name CHAR(25),
         Last_Name CHAR(25),
         Score INTEGER,
         FOREIGN KEY (Last_Name) REFERENCES target_db(Last_Name)
         ON DELETE CASCADE ON UPDATE CASCADE
     ); """
cur.execute(tg)

cur.execute('INSERT INTO tmpp SELECT * FROM target')
# cur.execute('SELECT * FROM tmpp').fetchall()
cur.execute("DROP TABLE target")
cur.execute("ALTER TABLE tmpp RENAME to target")

cur.execute("UPDATE target_db SET Last_Name = 'le' WHERE Last_Name = 'LEE'")
cur.execute("SELECT * FROM target").fetchall()

[('gg@naver.com', 'Heesu', 'KIM', 40), ('weg@jbnu.ac.kr', 'Dong', 'le', 20)]

###**기본키와 외래키: 참조무결성**
1. 외래키의 규칙을 바꿈 (외래키가 기본키 변화를 따라가는 규칙)
2. 결과를 확인

In [ ]:
conn.close()

#####접속을 끊음#####

In [ ]:
import sqlite3
conn = sqlite3.connect(':memory:')
conn = sqlite3.connect('./test2.db')

cur = conn.cursor()
cur.execute("CREATE TABLE t1 (id INT PRIMARY KEY, score1 REAL)")
cur.execute("CREATE TABLE t2 (id INT PRIMARY KEY, score2 REAL)")
cur.execute("CREATE TABLE t3 (id INT PRIMARY KEY, score3 INT)")

sql_query = """SELECT name FROM sqlite_master WHERE type ='table'"""
print(cur.execute(sql_query).fetchall())

cur.execute("INSERT INTO t1 VALUES (0, 20)")
cur.execute("INSERT INTO t1 VALUES (3, 20),(4, 60)")
print(cur.execute("SELECT * FROM t1").fetchall())

cur.execute("INSERT INTO t2 VALUES (0, 10), (1, 30)")
cur.execute("SELECT * FROM t2").fetchall()

[('t1',), ('t2',), ('t3',)]
[(0, 20.0), (3, 20.0), (4, 60.0)]

[(0, 10.0), (1, 30.0)]

###**조인: 데이터베이스 및 테이블 생성**
1. 세 개의 테이블을 구성
2. 모든 테이블들에서 id를 기본키로 설정

In [ ]:
cur.execute("INSERT INTO t3 VALUES (0,10),(3,10),(4,12)")
cur.execute("SELECT * FROM t3").fetchall()

[(0, 10), (3, 10), (4, 12)]

In [ ]:
cur.execute("SELECT t1.id, t1.score1, t2.id, t2.score2 FROM t1 LEFT JOIN t2 ON t1.id = t2.id")
cur.execute("SELECT t1.id, t1.score1, t2.id, t2.score2 FROM t2 LEFT JOIN t1 ON t1.id = t2.id")
print(cur.fetchall())

cur.execute("SELECT t1.id, t1.score1, t2.id, t2.score2 FROM t1 LEFT JOIN t2 ON t1.id = t2.id UNION SELECT t1.id, t1.score1, t2.id, t2.score2 FROM t2 LEFT JOIN t1 ON t1.id = t2.id")
print(cur.fetchall())

headers = list(map(lambda attr : attr[0], cur.description))
print(headers)
# cur.execute("SELECT * FROM t1 INNER JOIN t2 ON t1.id = t2.id")
# import pandas as pd
# df = pd.DataFrame(cur.fetchall(), columns=['t1.id','t1.score','t2.id','t2.score'])
# print(df)

[(0, 20.0, 0, 10.0), (None, None, 1, 30.0)]
[(None, None, 1, 30.0), (0, 20.0, 0, 10.0), (3, 20.0, None, None), (4, 60.0, None, None)]
['id', 'score1', 'id', 'score2']

###**조인: 여러 유형의 조인**
1. 내부 조인, 왼쪽 조인을 시행함
2. 왼족 조인을 이용해서 전체 외부 조인을 얻음, 여기에서 UNION 문을 이용

In [ ]:
import pandas as pd
df = pd.read_csv('./ZQ.csv')

# print(df)
cur.execute("DROP TABLE test")
df.to_sql('test', conn)

cur.execute('SELECT * FROM test')
headers = list(map(lambda attr : attr[0], cur.description))
print(headers)

rs = cur.execute('SELECT COUNT(*) FROM test').fetchall()
print(rs)
cur.execute('SELECT speed, COUNT(dst) FROM test GROUP BY speed ORDER by COUNT(*)').fetchall()
# cur.execute('SELECT speed, AVG(dst) FROM test GROUP BY speed ORDER by speed').fetchall()

['index', 'speed', 'dst']
[(50,)]

[(8, 1),
 (9, 1),
 (22, 1),
 (23, 1),
 (25, 1),
 (4, 2),
 (7, 2),
 (11, 2),
 (16, 2),
 (10, 3),
 (15, 3),
 (17, 3),
 (19, 3),
 (12, 4),
 (13, 4),
 (14, 4),
 (18, 4),
 (24, 4),
 (20, 5)]

###**통계량**

1. 외부데이터를 읽어서 테이블을 생성
2. 테이블 정보 확인
3. 개수나 평균을 확인 (GROUP BY, ORDER BY)